_site/boj-12605/index.html
<div id="outline-container-org90bbae9" class="outline-2">
<h2 id="org90bbae9">BOJ 12605 단어 순서 뒤집기</h2>
</div>

<div id="outline-container-orge02d549" class="outline-2">
<h2 id="orge02d549">접근하기</h2>
<div class="outline-text-2" id="text-orge02d549">
<ul class="org-ul">
<li>공백이 있는 문자열을 입력받기</li>
<li>토큰으로 분리 vector에 저장</li>
<li>vector를 역순으로 순회</li>
</ul>
</div>
</div>

<div id="outline-container-org6b313ec" class="outline-2">
<h2 id="org6b313ec">코드</h2>
<div class="outline-text-2" id="text-org6b313ec">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;iostream&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;sstream&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;string&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;vector&gt;</span>

<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">T</span>;

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">solve</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">tc</span>)
{
    <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">s</span>;
    getline(cin &gt;&gt; ws, s);

    <span style="color: #888a85;">// </span><span style="color: #888a85;">&#53664;&#53360;&#51004;&#47196; &#48516;&#47532;, vector&#50640; &#51200;&#51109;</span>
    <span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">split_char</span> = <span style="color: #ad7fa8; font-style: italic;">' '</span>;
    <span style="color: #8ae234; font-weight: bold;">istringstream</span> <span style="color: #ff6347;">split</span>(s);
    <span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">string</span>&gt; <span style="color: #ff6347;">tok</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">each</span>; getline(split, each, split_char);) {
        tok.push_back(each);
    }

    cout &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">"Case #"</span> &lt;&lt; tc &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">": "</span>;
    <span style="color: #888a85;">// </span><span style="color: #888a85;">vector&#47484; &#50669;&#49692;&#51004;&#47196; &#49692;&#54924;</span>
    <span style="color: #729fcf; font-weight: bold;">for</span> (<span style="color: #729fcf; font-weight: bold;">auto</span> <span style="color: #ff6347;">it</span> = tok.rbegin(); it != tok.rend(); it++) {
        cout &lt;&lt; *it &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">" "</span>;
    }
    cout &lt;&lt; endl;
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    cin &gt;&gt; T;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">tc</span>=1;tc&lt;=T;tc++) {
        solve(tc);
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a71d84" class="outline-2">
<h2 id="org3a71d84">문제 링크</h2>
<div class="outline-text-2" id="text-org3a71d84">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/12605">https://www.acmicpc.net/problem/12605</a></li>
</ul>
</div>
</div>
